Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase
The Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase is the abstract base class for custom JSON converter.

Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase.SupportedTypes
Gets the supported types.

Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase.CanWrite
Gets a value indicating whether this Newtonsoft.Json.JsonConverter can write JSON.
true if this Newtonsoft.Json.JsonConverter can write JSON; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase.ValueOrDefault``1(Newtonsoft.Json.Linq.JObject,System.String)
Gets the value of the token from the Newtonsoft.Json.Linq.JObject or default value if the token does not exist.
Thevalue type.
jsonObject: The JSON object.
name: The path name.
Returns: The value of the token from the Newtonsoft.Json.Linq.JObject or default value if the token does not exist.

Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase.CanConvert(System.Type)
Determines whether this instance can convert the specified object type.
objectType: Type of the object.
Returns: true if this instance can convert the specified object type; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Session.JsonConverterBase.WriteJson(Newtonsoft.Json.JsonWriter,System.Object,Newtonsoft.Json.JsonSerializer)
Writes the JSON representation of the object.
writer: The Newtonsoft.Json.JsonWriter to write to.
value: The value.
serializer: The calling serializer.